---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.PipingTemperature
source: html/0a4ab95f-13d6-0789-ce75-2c28dd06a219.htm
---
# Autodesk.Revit.DB.SpecTypeId.PipingTemperature Property

Temperature, in discipline Piping.

## Syntax (C#)
```csharp
public static ForgeTypeId PipingTemperature { get; }
```